Project/Toir/src/DataProcessors/торо_РабочееМестоТехнолога/торо_РабочееМестоТехнолога.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>торо_РабочееМестоТехнолога</name>
</mdclass:DataProcessor>

Project/Toir/src/InformationRegisters/торо_ИерархическиеСтруктурыОР/торо_ИерархическиеСтруктурыОР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ИерархическиеСтруктурыОР</name>
  <resources>
    <name>РодительИерархии</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектИерархии</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтруктураИерархии</name>
    <type>
      <types>CatalogRef.торо_СтруктурыОР</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_РасположениеОРВСтруктуреИерархии/торо_РасположениеОРВСтруктуреИерархии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_РасположениеОРВСтруктуреИерархии</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>РодительИерархии</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </resources>
  <resources>
    <name>Удален</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектИерархии</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтруктураИерархии</name>
    <type>
      <types>CatalogRef.торо_СтруктурыОР</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_ОграниченияНаХарактеристикиОборудования/торо_ОграниченияНаХарактеристикиОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ОграниченияНаХарактеристикиОборудования</name>
  <resources>
    <name>гкс_Удален</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ФункциональноеМесто</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Иерархия</name>
    <type>
      <types>CatalogRef.торо_СтруктурыОР</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ограничение</name>
    <type>
      <types>CatalogRef.торо_ОграниченияНаХарактеристикиОбрудования</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/торо_ЗначенияКонтролируемыхПоказателей/торо_ЗначенияКонтролируемыхПоказателей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ЗначенияКонтролируемыхПоказателей</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Значение</name>
    <type>
      <types>Characteristic.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
    </type>
  </resources>
  <dimensions>
    <name>ДатаКонтроля</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.торо_ИзмеряемыеПоказателиОбъектовРемонта</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/Enums/торо_ТипыОбъектовRCM/торо_ТипыОбъектовRCM.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_ТипыОбъектовRCM</name>
  <enumValues>
    <name>Объект</name>
  </enumValues>
  <enumValues>
    <name>ФункциональноеМесто</name>
  </enumValues>
  <enumValues>
    <name>Система</name>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/Enums/торо_ВидыСравнения/торо_ВидыСравнения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_ВидыСравнения</name>
  <enumValues>
    <name>Больше</name>
  </enumValues>
  <enumValues>
    <name>БольшеИлиРавно</name>
  </enumValues>
  <enumValues>
    <name>Меньше</name>
  </enumValues>
  <enumValues>
    <name>МеньшеИлиРавно</name>
  </enumValues>
  <enumValues>
    <name>Равно</name>
  </enumValues>
  <enumValues>
    <name>НеРавно</name>
  </enumValues>
  <enumValues>
    <name>ВИнтервале</name>
  </enumValues>
  <enumValues>
    <name>НеВИнтервале</name>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/Documents/торо_ИзменениеПоложенияВСтруктуреИерархии/торо_ИзменениеПоложенияВСтруктуреИерархии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>торо_ИзменениеПоложенияВСтруктуреИерархии</name>
  <registerRecords>InformationRegister.торо_РасположениеОРВСтруктуреИерархии</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктураИерархии</name>
    <type>
      <types>CatalogRef.торо_СтруктурыОР</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПоложенияВСтруктуреИерархии</name>
    <attributes>
      <name>ОбъектИерархии</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>РодительИерархии</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Удален</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредыдущееПоложение</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Project/Toir/src/Catalogs/торо_ТиповыеОР/торо_ТиповыеОР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_ТиповыеОР</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Изготовитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>String</types>
      <types>CatalogRef.Производители</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>CatalogRef.торо_НаправленияОбъектовРемонтныхРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборСвойствОР</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлКартинки</name>
    <type>
      <types>CatalogRef.торо_ТиповыеОРПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>КодГруппы</name>
    <type>
      <types>CatalogRef.гкс_ГруппыОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъекта</name>
    <type>
      <types>EnumRef.торо_ТипыОбъектовRCM</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_Модель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>гкс_Критичность</name>
    <comment>Гкс+[TOIR20-94] Борисов В.М. от 05.06.2020</comment>
    <type>
      <types>CatalogRef.гкс_Критичность</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ОтветственныйИнженер</name>
    <comment>Гкс+[TOIR20-94] Борисов В.М. от 05.06.2020</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НормативныеРемонты</name>
    <attributes>
      <name>ВидРемонта</name>
      <type>
        <types>CatalogRef.торо_ВидыРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>НормативныйРемонт</name>
      <type>
        <types>CatalogRef.торо_ИдентификаторыТехКарт</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособПланирования</name>
      <type>
        <types>CatalogRef.торо_СпособыПланированияРемонтныхРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>EnumRef.торо_СтатусыНормативныхРемонтовИТехКарт</types>
      </type>
    </attributes>
    <attributes>
      <name>ГрафикРемонтныхРабот</name>
      <type>
        <types>CatalogRef.Календари</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособВыполнения</name>
      <type>
        <types>EnumRef.СпособыСтроительства</types>
      </type>
    </attributes>
    <attributes>
      <name>НеИспользоватьВПланированииДатуВводаВЭксплуатацию</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособУчетаДатыОтсчета</name>
      <type>
        <types>EnumRef.торо_СпособыУчетаДатыОтсчетаПриПланированииРемонтныхРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>НеУчаствуетВПланировании</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>РазрешитьСокращатьМежремонтныйПериодПриПланировании</name>
      <comment>Разрешить сокращать межремонтный период в случае, если начало ремонта приходится на выходной день</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НеУчитыватьПриПланированииГрафикРаботыОборудования</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НеУчитыватьПриПланированииГрафикРемонтныхРабот</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НеУчитыватьПродолжительность</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИспользоватьКоэффициентыРемонтныхОсобенностей</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>УчитыватьПростоиОборудования</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПредшествующиеРемонты</name>
    <attributes>
      <name>ВидРемонта</name>
      <type>
        <types>CatalogRef.торо_ВидыРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредшествующийВидРемонта</name>
      <type>
        <types>CatalogRef.торо_ВидыРемонтов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗамещаемыеРемонты</name>
    <attributes>
      <name>ВидРемонта</name>
      <type>
        <types>CatalogRef.торо_ВидыРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗамещаемыйВидРемонта</name>
      <type>
        <types>CatalogRef.торо_ВидыРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособЗамещения</name>
      <type>
        <types>EnumRef.торо_СпособыЗамещенияРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>НачальнаяГраница</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонечнаяГраница</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Запчасти</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Качество</name>
      <type>
        <types>EnumRef.ГрадацииКачества</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НормативныеЗатратыПриТОиР</name>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРемонта</name>
      <type>
        <types>CatalogRef.торо_ВидыРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОграниченияНаХарактеристикиОборудования</name>
    <attributes>
      <name>Ограничение</name>
      <type>
        <types>CatalogRef.торо_ОграниченияНаХарактеристикиОбрудования</types>
      </type>
    </attributes>
    <attributes>
      <name>Иерархия</name>
      <type>
        <types>CatalogRef.торо_СтруктурыОР</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>гкс_КонструктивныйСостав</name>
    <attributes>
      <name>Компонент</name>
      <type>
        <types>CatalogRef.гкс_Компоненты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Project/Toir/src/DataProcessors/торо_РабочееМестоТехнолога/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТипОбъектаФМ = Перечисления.торо_ТипыОбъектовRCM.ФункциональноеМесто;
	ТипПоиска = "Наименование";
	
	ТекСтруктураИерархии = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
	"НастройкиТОиР",
	"ОсновнаяСтруктураИерархии",
	Истина);
	
	ИспользоватьКартинкиТОР = Константы.торо_ИспользоватьКартинкиТиповыхОбъектов.Получить();
	
	РазрешитьПеретаскиваниеОРВИерархии = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиТОиР", "РазрешитьПеретаскиваниеОРВИерархии", Истина);
	
	ОбработатьИзменениеИерархииНаСервере();
	
	Если ИспользоватьКартинкиТОР Тогда 
		Элементы.Дерево.ПутьКДаннымКартинкиСтроки = "Дерево.КартинкаОтображаемая";
	Иначе 
		Элементы.Дерево.ПутьКДаннымКартинкиСтроки = "Дерево.Картинка";
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеИерархииНаСервере()
	
	торо_РаботаСИерархией20.ЗаполнитьПараметрыИерархии(ЭтаФорма);
	СтруктураПараметровИерархии.КонечныеЭлементыВДереве = Истина;
	ПустойРодитель = торо_РаботаСИерархией20.ПустойРодительПоСтруктуреИерархии(СтруктураПараметровИерархии);
	торо_РаботаСИерархией20.УстановитьЗапросВСпискеПоИерархии(Список, СтруктураПараметровИерархии, ПустойРодитель);
	торо_РаботаСИерархией20КлиентСервер.УстановитьОтборСпискаПоРодителю(Список, ПустойРодитель, Ложь);
	торо_РаботаСИерархией20КлиентСервер.НачатьЗаполнениеДереваИерархии(Дерево, СтруктураПараметровИерархии, ПустойРодитель);
	
	Если ИспользоватьКартинкиТОР Тогда
		ОбновитьКартинкиЭлементовДереваНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаСервере 
Процедура ОбновитьКартинкиЭлементовДереваНаСервере(ИдентификаторСтроки = 0)
	торо_РаботаСИерархией20.ОбновитьКартинкиЭлементовДереваНаСервере(Дерево, ИдентификаторСтроки);
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПередРазворачиванием(Элемент, Строка, Отказ)
	
	торо_РаботаСИерархией20Клиент.ДеревоПередРазворачиванием(Дерево, Строка, СтруктураПараметровИерархии);
	Если ИспользоватьКартинкиТОР Тогда
		ОбновитьКартинкиЭлементовДереваНаСервере(Строка);
	КонецЕсли;
	
	ДозаполнитьДеревоНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПередНачаломИзменения(Элемент, Отказ)
	торо_РаботаСИерархией20Клиент.ПередНачаломИзменения(Элемент, Отказ, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("ЗаполнитьДанныеОРНаКлиенте",0.1,Истина);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеОРНаКлиенте()
	ТекущиеДанные = Элементы.Дерево.ТекущиеДанные;
	Если Не ТекущиеДанные = Неопределено Тогда 
		Если ТекущиеДанные.ТипОбъекта = ТипОбъектаФМ Тогда 
			ОбновитьОграничения(ТекущиеДанные.Ссылка,Истина);
			ИзмеряемыеПоказатели.Очистить();
			ПаспортныеХарактеристики.Очистить();
		Иначе
			ОбновитьОграничения(ТекущиеДанные.Ссылка,Ложь);
			ОбновитьХарактеристика(ТекущиеДанные.Ссылка);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
// Таблица ограничений
&НаСервере
Процедура ОбновитьОграничения(Ссылка, ЭтоФМ)
	Ограничения.Очистить();
	Запрос = Новый Запрос;
	Если ЭтоФМ Тогда 
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	торо_ОбъектыРемонта.Ссылка КАК ФМ,
			|	торо_ОбъектыРемонта.ТиповойОР КАК ФМТОР
			|ПОМЕСТИТЬ ТекФМ
			|ИЗ
			|	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
			|ГДЕ
			|	торо_ОбъектыРемонта.Ссылка = &Ссылка
			|";
	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_ИерархическиеСтруктурыОР.РодительИерархии КАК ФМ,
		|	торо_ИерархическиеСтруктурыОР.РодительИерархии.ТиповойОР КАК ТОР
		|ПОМЕСТИТЬ НужныйРодитель
		|ИЗ
		|	РегистрСведений.торо_ИерархическиеСтруктурыОР КАК торо_ИерархическиеСтруктурыОР
		|ГДЕ
		|	торо_ИерархическиеСтруктурыОР.СтруктураИерархии = &Иерархия
		|	И торо_ИерархическиеСтруктурыОР.ОбъектИерархии = &Ссылка
		|	И торо_ИерархическиеСтруктурыОР.РодительИерархии.ТипОбъекта = ЗНАЧЕНИЕ(Перечисление.торо_ТипыОбъектовRCM.ФункциональноеМесто)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	торо_РасположениеОРВСтруктуреИерархииСрезПоследних.РодительИерархии,
		|	торо_РасположениеОРВСтруктуреИерархииСрезПоследних.РодительИерархии.ТиповойОР
		|ИЗ
		|	РегистрСведений.торо_РасположениеОРВСтруктуреИерархии.СрезПоследних(
		|			,
		|			ОбъектИерархии = &Ссылка
		|				И СтруктураИерархии = &Иерархия) КАК торо_РасположениеОРВСтруктуреИерархииСрезПоследних
		|ГДЕ
		|	торо_РасположениеОРВСтруктуреИерархииСрезПоследних.РодительИерархии.ТипОбъекта = ЗНАЧЕНИЕ(Перечисление.торо_ТипыОбъектовRCM.ФункциональноеМесто)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	НужныйРодитель.ТОР КАК ФМТОР,
		|	НужныйРодитель.ФМ КАК ФМ
		|ПОМЕСТИТЬ ТекФМ
		|ИЗ
		|	НужныйРодитель КАК НужныйРодитель";
	КонецЕсли;
	Запрос.Текст = Запрос.Текст + " ;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|"+"ВЫБРАТЬ РАЗЛИЧНЫЕ
		   |	торо_ТиповыеОРОграниченияНаХарактеристикиОборудования.Ограничение КАК Ограничение,
		   |	ЛОЖЬ КАК гкс_Удален,
		   |	торо_ТиповыеОРОграниченияНаХарактеристикиОборудования.Иерархия КАК Иерархия
		   |ПОМЕСТИТЬ ОграниченияФМ
		   |ИЗ
		   |	ТекФМ КАК ТекФМ
		   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ТиповыеОР.ОграниченияНаХарактеристикиОборудования КАК торо_ТиповыеОРОграниченияНаХарактеристикиОборудования
		   |		ПО ТекФМ.ФМТОР = торо_ТиповыеОРОграниченияНаХарактеристикиОборудования.Ссылка
		   |
		   |ОБЪЕДИНИТЬ ВСЕ
		   |
		   |ВЫБРАТЬ
		   |	торо_ОграниченияНаХарактеристикиОборудования.Ограничение,
		   |	торо_ОграниченияНаХарактеристикиОборудования.гкс_Удален,
		   |	торо_ОграниченияНаХарактеристикиОборудования.Иерархия
		   |ИЗ
		   |	ТекФМ КАК ТекФМ
		   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_ОграниченияНаХарактеристикиОборудования КАК торо_ОграниченияНаХарактеристикиОборудования
		   |		ПО ТекФМ.ФМ = торо_ОграниченияНаХарактеристикиОборудования.ФункциональноеМесто
		   |			И (торо_ОграниченияНаХарактеристикиОборудования.Иерархия В (&Иерархии))
		   |;
		   |
		   |////////////////////////////////////////////////////////////////////////////////
		   |ВЫБРАТЬ
		   |	ОграниченияФМ.Ограничение КАК Ограничение,
		   |	МАКСИМУМ(ОграниченияФМ.гкс_Удален) КАК гкс_Удален,
		   |	ОграниченияФМ.Иерархия КАК Иерархия
		   |ПОМЕСТИТЬ БезУдаленных
		   |ИЗ
		   |	ОграниченияФМ КАК ОграниченияФМ
		   |
		   |СГРУППИРОВАТЬ ПО
		   |	ОграниченияФМ.Ограничение,
		   |	ОграниченияФМ.Иерархия
		   |;
		   |
		   |////////////////////////////////////////////////////////////////////////////////
		   |ВЫБРАТЬ РАЗЛИЧНЫЕ
		   |	БезУдаленных.Ограничение КАК Ограничение,
		   |	торо_ОграниченияНаХарактеристикиОбрудованияСписокОграничений.Характеристика КАК Характеристика,
		   |	торо_ОграниченияНаХарактеристикиОбрудованияСписокОграничений.ВидСравнения КАК ВидСравнения,
		   |	торо_ОграниченияНаХарактеристикиОбрудованияСписокОграничений.Значение КАК Значение
		   |ИЗ
		   |	БезУдаленных КАК БезУдаленных
		   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ОграниченияНаХарактеристикиОбрудования.СписокОграничений КАК торо_ОграниченияНаХарактеристикиОбрудованияСписокОграничений
		   |		ПО БезУдаленных.Ограничение = торо_ОграниченияНаХарактеристикиОбрудованияСписокОграничений.Ссылка
		   |ГДЕ
		   |	БезУдаленных.гкс_Удален = ЛОЖЬ
		   |
		   |ОБЪЕДИНИТЬ ВСЕ
		   |
		   |ВЫБРАТЬ РАЗЛИЧНЫЕ
		   |	БезУдаленных.Ограничение,
		   |	торо_ОграниченияНаХарактеристикиОбрудованияСписокОграниченийПоказатели.Характеристика,
		   |	торо_ОграниченияНаХарактеристикиОбрудованияСписокОграниченийПоказатели.ВидСравнения,
		   |	торо_ОграниченияНаХарактеристикиОбрудованияСписокОграниченийПоказатели.Значение
		   |ИЗ
		   |	БезУдаленных КАК БезУдаленных
		   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ОграниченияНаХарактеристикиОбрудования.СписокОграниченийПоказатели КАК торо_ОграниченияНаХарактеристикиОбрудованияСписокОграниченийПоказатели
		   |		ПО БезУдаленных.Ограничение = торо_ОграниченияНаХарактеристикиОбрудованияСписокОграниченийПоказатели.Ссылка
		   |ГДЕ
		   |	БезУдаленных.гкс_Удален = ЛОЖЬ";
	
	ТемпМассив = Новый Массив();
	ТемпМассив.Добавить(ТекСтруктураИерархии);
	ТемпМассив.Добавить(Справочники.торо_СтруктурыОР.ПустаяСсылка());
	Запрос.УстановитьПараметр("Иерархии",ТемпМассив);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Если ЭтоФМ = Ложь Тогда 
		Запрос.УстановитьПараметр("Иерархия",ТекСтруктураИерархии);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
			НС = Ограничения.Добавить();
			НС.Ограничение = Выборка.Ограничение;
			НС.дс_Текст = Строка(Выборка.Характеристика)+" "+Выборка.ВидСравнения+" "+Выборка.Значение;
	КонецЦикла;

КонецПроцедуры
// Таблицы текущих характеристик
&НаСервере
Процедура ОбновитьХарактеристика(Ссылка)
	ИзмеряемыеПоказатели.Очистить();
	ПаспортныеХарактеристики.Очистить();
	Если ЗначениеЗаполнено(Ссылка) = Ложь Тогда 
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	торо_ОбъектыРемонта.Ссылка КАК ОР,
	|	торо_ОбъектыРемонта.ТиповойОР КАК ТОР
	|ПОМЕСТИТЬ ВсеОР
	|ИЗ
	|	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
	|ГДЕ
	|	торо_ОбъектыРемонта.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЧ.Ограничение КАК Ограничение
	|ПОМЕСТИТЬ Ограничения
	|ИЗ
	|	&ТЧ КАК ТЧ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	торо_ЗначенияКонтролируемыхПоказателейСрезПоследних.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_ЗначенияКонтролируемыхПоказателейСрезПоследних.Показатель КАК Показатель,
	|	торо_ЗначенияКонтролируемыхПоказателейСрезПоследних.Значение КАК Значение,
	|	торо_ЗначенияКонтролируемыхПоказателейСрезПоследних.ДатаКонтроля КАК ДатаКонтроля
	|ПОМЕСТИТЬ ПоказателиОР
	|ИЗ
	|	РегистрСведений.торо_ЗначенияКонтролируемыхПоказателей.СрезПоследних(, ОбъектРемонта = &Ссылка) КАК торо_ЗначенияКонтролируемыхПоказателейСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоказателиОР.ОбъектРемонта КАК ОбъектРемонта,
	|	ПоказателиОР.Показатель КАК Показатель,
	|	МАКСИМУМ(ПоказателиОР.ДатаКонтроля) КАК ДатаКонтроля
	|ПОМЕСТИТЬ ПоказателиОРМаксимум
	|ИЗ
	|	ПоказателиОР КАК ПоказателиОР
	|
	|СГРУППИРОВАТЬ ПО
	|	ПоказателиОР.ОбъектРемонта,
	|	ПоказателиОР.Показатель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПоказателиОР.Показатель КАК Показатель,
	|	ПоказателиОР.Значение КАК Значение
	|ПОМЕСТИТЬ ПоказателиОРСрез
	|ИЗ
	|	ПоказателиОР КАК ПоказателиОР
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПоказателиОРМаксимум КАК ПоказателиОРМаксимум
	|		ПО ПоказателиОР.ОбъектРемонта = ПоказателиОРМаксимум.ОбъектРемонта
	|			И ПоказателиОР.Показатель = ПоказателиОРМаксимум.Показатель
	|			И ПоказателиОР.ДатаКонтроля = ПоказателиОРМаксимум.ДатаКонтроля
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	торо_ТиповыеОРДополнительныеРеквизиты.Свойство КАК Свойство,
	|	торо_ТиповыеОРДополнительныеРеквизиты.Значение КАК Значение
	|ПОМЕСТИТЬ РеквизитыТОР
	|ИЗ
	|	ВсеОР КАК ВсеОР
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ТиповыеОР.ДополнительныеРеквизиты КАК торо_ТиповыеОРДополнительныеРеквизиты
	|		ПО ВсеОР.ТОР = торо_ТиповыеОРДополнительныеРеквизиты.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	торо_ОграниченияНаХарактеристикиОбрудованияСписокОграничений.Характеристика КАК Характеристика,
	|	торо_ОграниченияНаХарактеристикиОбрудованияСписокОграничений.ВидСравнения КАК ВидСравнения,
	|	торо_ОграниченияНаХарактеристикиОбрудованияСписокОграничений.Значение КАК Значение
	|ПОМЕСТИТЬ ОграниченияХаракетристики1
	|ИЗ
	|	Ограничения КАК Ограничения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ОграниченияНаХарактеристикиОбрудования.СписокОграничений КАК торо_ОграниченияНаХарактеристикиОбрудованияСписокОграничений
	|		ПО Ограничения.Ограничение = торо_ОграниченияНаХарактеристикиОбрудованияСписокОграничений.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОграниченияРеквизиты.ВидСравнения КАК ВидСравнения,
	|	ОграниченияРеквизиты.Значение КАК Значение,
	|	ЕСТЬNULL(торо_ГруппыХарактеристикОборудованияСписокХарактеристик.Характеристика, ОграниченияРеквизиты.Характеристика) КАК Характеристика
	|ПОМЕСТИТЬ ОграниченияХаракетристики
	|ИЗ
	|	ОграниченияХаракетристики1 КАК ОграниченияРеквизиты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.торо_ГруппыХарактеристикОборудования.СписокХарактеристик КАК торо_ГруппыХарактеристикОборудованияСписокХарактеристик
	|		ПО ОграниченияРеквизиты.Характеристика = торо_ГруппыХарактеристикОборудованияСписокХарактеристик.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	торо_ОграниченияНаХарактеристикиОбрудованияСписокОграниченийПоказатели.Характеристика КАК Характеристика,
	|	торо_ОграниченияНаХарактеристикиОбрудованияСписокОграниченийПоказатели.ВидСравнения КАК ВидСравнения,
	|	торо_ОграниченияНаХарактеристикиОбрудованияСписокОграниченийПоказатели.Значение КАК Значение
	|ПОМЕСТИТЬ ОграниченияПоказатели
	|ИЗ
	|	Ограничения КАК Ограничения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ОграниченияНаХарактеристикиОбрудования.СписокОграниченийПоказатели КАК торо_ОграниченияНаХарактеристикиОбрудованияСписокОграниченийПоказатели
	|		ПО Ограничения.Ограничение = торо_ОграниченияНаХарактеристикиОбрудованияСписокОграниченийПоказатели.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПоказателиОРСрез.Показатель КАК Свойство,
	|	ПоказателиОРСрез.Значение КАК Факт,
	|	ОграниченияПоказатели.ВидСравнения КАК ВидСравнения,
	|	ОграниченияПоказатели.Значение КАК План
	|ИЗ
	|	ПоказателиОРСрез КАК ПоказателиОРСрез
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОграниченияПоказатели КАК ОграниченияПоказатели
	|		ПО ПоказателиОРСрез.Показатель = ОграниченияПоказатели.Характеристика
	|ИТОГИ
	|	МАКСИМУМ(Факт)
	|ПО
	|	Свойство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеквизитыТОР.Свойство КАК Свойство,
	|	РеквизитыТОР.Значение КАК Факт,
	|	ОграниченияХаракетристики.ВидСравнения КАК ВидСравнения,
	|	ОграниченияХаракетристики.Значение КАК План
	|ИЗ
	|	РеквизитыТОР КАК РеквизитыТОР
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОграниченияХаракетристики КАК ОграниченияХаракетристики
	|		ПО РеквизитыТОР.Свойство = ОграниченияХаракетристики.Характеристика
	|ИТОГИ
	|	МАКСИМУМ(Факт)
	|ПО
	|	Свойство";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ТЧ", Ограничения.Выгрузить());
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Выборка = РезультатЗапроса[9].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка.Следующий() Цикл
		НС = ИзмеряемыеПоказатели.Добавить();
		НС.Характеристика = Выборка.Свойство;
		НС.Значение = Выборка.Факт;
		НеПодходит = Ложь;
		Выборка1 = Выборка.выбрать();
		ПроверитьХарактеристику(НеПодходит,Выборка1);
		НС.Подходит = Не НеПодходит;
	КонецЦикла;

	Выборка = РезультатЗапроса[10].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка.Следующий() Цикл
		НС = ПаспортныеХарактеристики.Добавить();
		НС.Характеристика = Выборка.Свойство;
		НС.Значение = Выборка.Факт;
		НеПодходит = Ложь;
		Выборка1 = Выборка.выбрать();
		ПроверитьХарактеристику(НеПодходит,Выборка1);
		НС.Подходит = Не НеПодходит;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ПроверитьХарактеристику(НеПодходит,Выборка1)
	Пока Выборка1.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка1.Свойство)=Ложь Тогда 
			Продолжить;
		КонецЕсли;
		ТипФакта = ТипЗнч(Выборка1.Факт);
		ТипПлана = ТипЗнч(Выборка1.План);
		Если Не ТипФакта = ТипПлана Тогда 
			Продолжить;
		КонецЕсли;
		Если Выборка1.ВидСравнения = Перечисления.торо_ВидыСравнения.Равно Тогда 
			Если Не Выборка1.План = Выборка1.Факт Тогда 
				НеПодходит = Истина;
				Прервать;
			КонецЕсли;
		ИначеЕсли Выборка1.ВидСравнения = Перечисления.торо_ВидыСравнения.НеРавно Тогда 
			Если Выборка1.План = Выборка1.Факт Тогда 
				НеПодходит = Истина;
				Прервать;
			КонецЕсли;
		ИначеЕсли ТипФакта = Тип("Число") ИЛИ ТипФакта = Тип("Дата") Тогда 
			Если Выборка1.ВидСравнения = Перечисления.торо_ВидыСравнения.Больше Тогда 
				Если Выборка1.План >= Выборка1.Факт Тогда 
					НеПодходит = Истина;
					Прервать;
				КонецЕсли;
			ИначеЕсли Выборка1.ВидСравнения = Перечисления.торо_ВидыСравнения.БольшеИлиРавно Тогда 
				Если Выборка1.План > Выборка1.Факт Тогда 
					НеПодходит = Истина;
					Прервать;
				КонецЕсли;
			ИначеЕсли Выборка1.ВидСравнения = Перечисления.торо_ВидыСравнения.Меньше Тогда 
				Если Выборка1.План <= Выборка1.Факт Тогда 
					НеПодходит = Истина;
					Прервать;
				КонецЕсли;
			ИначеЕсли Выборка1.ВидСравнения = Перечисления.торо_ВидыСравнения.МеньшеИлиРавно Тогда 
				Если Выборка1.План < Выборка1.Факт Тогда 
					НеПодходит = Истина;
					Прервать;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
//
&НаКлиенте
Процедура ДеревоВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОценкаПроизводительностиКлиент.ЗамерВремени(ПредопределенноеЗначение("Справочник.КлючевыеОперации.торо_ОткрытиеФормыОбъектовРемонта"),,Истина);
	
	СтандартнаяОбработка = Ложь;
	торо_РаботаСИерархией20Клиент.ПередНачаломИзменения(Элемент, Ложь, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеПоискаПриИзменении(Элемент)
	ВыполнитьПоискВСпискеОР(ЗначениеПоиска);
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПоискВСпискеОР(Текст)
	
	Если СтрДлина(Текст) = 0 Тогда
		ОтменитьПоискВПискеОР();
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТипПоиска) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, ТипПоиска, Текст, ВидСравненияКомпоновкиДанных.Содержит,,Истина);
	КонецЕсли;
	
	Элементы.СтраницыГруппаЛевая.ТекущаяСтраница = Элементы.ГруппаТаблицаПоиска;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьПоискВПискеОР()
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, ТипПоиска, "", ВидСравненияКомпоновкиДанных.Содержит,,Ложь);
	Элементы.СтраницыГруппаЛевая.ТекущаяСтраница = Элементы.ГруппаДерево;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеПоискаОчистка(Элемент, СтандартнаяОбработка)
	ОтменитьПоискВПискеОР();	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеПоискаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	ЗначениеПоиска = Текст;
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеПоискаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	Если Ожидание > 0 Тогда
		ВыполнитьПоискВСпискеОР(Текст);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТипПоискаПриИзменении(Элемент)
	ВыполнитьПоискВСпискеОР(ЗначениеПоиска);
КонецПроцедуры

&НаКлиенте
Процедура ТипПоискаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ВыбранноеЗначение <> ТипПоиска Тогда
		ОтменитьПоискВПискеОР();
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	ИспользоватьКартинкиТОР = Константы.торо_ИспользоватьКартинкиТиповыхОбъектов.Получить();
	торо_РаботаСИерархией20.СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки, ИспользоватьКартинкиТОР);
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОценкаПроизводительностиКлиент.ЗамерВремени(ПредопределенноеЗначение("Справочник.КлючевыеОперации.торо_ОткрытиеФормыОбъектовРемонта"),,Истина);
	
	СтандартнаяОбработка = Ложь;
	Если Не Элементы.Список.ТекущиеДанные = Неопределено Тогда
		ПоказатьЗначение(Неопределено, Элементы.Список.ТекущиеДанные.Ссылка);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ЗаполнитьДанныеОРНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура НастройкаИерархииЗавершение(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение <> Неопределено Тогда
		ТекСтруктураИерархии = ВыбранноеЗначение.СтруктураИерархии;
		ОбработатьИзменениеИерархииНаСервере();
		торо_РаботаСИерархией20Клиент.ОбработатьИзменениеИерархииНаКлиенте(ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	Выполнение = РазрешитьПеретаскиваниеОРВИерархии;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	торо_РаботаСИерархией20Клиент.ПроверкаПеретаскивания(ЭтаФорма, Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	торо_РаботаСИерархией20Клиент.ОбработкаПеретаскивания(ЭтаФорма, Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ДеревоОкончаниеПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	торо_РаботаСИерархией20Клиент.ОбновитьДеревоИерархии(ЭтотОбъект, "Дерево");
	Для Каждого СМ Из ПараметрыПеретаскивания.Значение Цикл
		Для Каждого СТ Из ПроверенныеОР Цикл
			Если СТ.ОР = СМ.Ссылка Тогда 
				ПроверенныеОР.Удалить(СТ);
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	ДозаполнитьДеревоНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьФМ(Команда)
	Если Этаформа.ТекущийЭлемент = Элементы.Дерево Тогда 
		ТекДанные = Элементы.Дерево.ТекущиеДанные;
	Иначе
		ТекДанные = Элементы.Список.ТекущиеДанные;
	КонецЕсли;
	Если Не ТекДанные = Неопределено Тогда 
		// Справочники.торо_ОбъектыРемонта.ПустаяСсылка()
		СтруктураОпОп = Новый Структура();
		ОпОп = Новый ОписаниеОповещения("ПослеСозданияФМ",ЭтотОбъект,СтруктураОпОп);
		ТемпРодитель = ТекДанные.Ссылка;
		ОткрытьФорму("Справочник.торо_ОбъектыРемонта.Форма.ФормаЭлемента",Новый Структура("СтруктураИерархии, РодительИерархии, СоздатьФМ", ТекСтруктураИерархии, ТемпРодитель,Истина),,,,,ОпОп);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеСозданияФМ(Результат, ДопПараметры)Экспорт
	торо_РаботаСИерархией20Клиент.ОбновитьДеревоИерархии(ЭтотОбъект, "Дерево");
	ДозаполнитьДеревоНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФМИзИерархии(Команда)
	Если Этаформа.ТекущийЭлемент = Элементы.Дерево Тогда 
		ТекДанные = Элементы.Дерево.ТекущиеДанные;
	Иначе
		ТекДанные = Элементы.Список.ТекущиеДанные;
	КонецЕсли;

	Если Не ТекДанные = Неопределено Тогда 
		ТемпРодитель = ТекДанные.Ссылка;
		СтруктураОпОп = Новый Структура("Родитель, Иерархия", ТемпРодитель, ТекСтруктураИерархии);
		ОписаниеОповещенияПослеВыбора = Новый ОписаниеОповещения("ДобавитьФМВИерархию", ЭтотОбъект, СтруктураОпОп);
		СтрПарметрыФормы = Новый Структура("ОтборТипОбъекта,ИспользоватьОтборТипОбъекта",
				ТипОбъектаФМ, Истина);
		ОткрытьФорму("Справочник.торо_ОбъектыРемонта.ФормаВыбора", СтрПарметрыФормы,,,,, ОписаниеОповещенияПослеВыбора, 
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФМВИерархию(Результат, ДопПараметры)Экспорт
	Если ЗначениеЗаполнено(Результат) Тогда 
		
		ДобавитьФМВИерархиюНаСервере(Результат,ДопПараметры.Родитель,ДопПараметры.Иерархия);
		торо_РаботаСИерархией20Клиент.ОбновитьДеревоИерархии(ЭтотОбъект, "Дерево");
		ДозаполнитьДеревоНаКлиенте();
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДобавитьФМВИерархиюНаСервере(ФМ, Родитель, Иерархия)
	Если ТипЗнч(ФМ) = Тип("Массив") Тогда 
		Для Каждого СМ Из ФМ Цикл
			Если Иерархия.ИзменяетсяДокументами Тогда 
				Док = Документы.торо_ИзменениеПоложенияВСтруктуреИерархии.СоздатьДокумент();
				Док.Дата = ТекущаяДата();
				Док.Комментарий = "Добавлен из другой иерархии";
				Док.СтруктураИерархии = Иерархия;
				Док.Ответственный = ПараметрыСеанса.ТекущийПользователь;
				НС = Док.ПоложенияВСтруктуреИерархии.Добавить();
				НС.ОбъектИерархии = СМ;
				НС.РодительИерархии = Родитель;
				Док.Записать(РежимЗаписиДокумента.Проведение);
			Иначе
				НЗ = РегистрыСведений.торо_ИерархическиеСтруктурыОР.СоздатьНаборЗаписей();
				НЗ.Отбор.ОбъектИерархии.Установить(СМ);
				НЗ.Отбор.СтруктураИерархии.Установить(Иерархия);
				НС = НЗ.Добавить();
				НС.ОбъектИерархии = СМ;
				НС.СтруктураИерархии = Иерархия;
				НС.РодительИерархии = Родитель;
				НЗ.Записать();
			КонецЕсли;
		КонецЦикла;
	Иначе
		Если Иерархия.ИзменяетсяДокументами Тогда 
			Док = Документы.торо_ИзменениеПоложенияВСтруктуреИерархии.СоздатьДокумент();
			Док.Дата = ТекущаяДата();
			Док.Комментарий = "Добавлен из другой иерархии";
			Док.СтруктураИерархии = Иерархия;
			Док.Ответственный = ПараметрыСеанса.ТекущийПользователь;
			НС = Док.ПоложенияВСтруктуреИерархии.Добавить();
			НС.ОбъектИерархии = ФМ;
			НС.РодительИерархии = Родитель;
			Док.Записать(РежимЗаписиДокумента.Проведение);
		Иначе
			НЗ = РегистрыСведений.торо_ИерархическиеСтруктурыОР.СоздатьНаборЗаписей();
			НЗ.Отбор.ОбъектИерархии.Установить(ФМ);
			НЗ.Отбор.СтруктураИерархии.Установить(Иерархия);
			НС = НЗ.Добавить();
			НС.ОбъектИерархии = ФМ;
			НС.СтруктураИерархии = Иерархия;
			НС.РодительИерархии = Родитель;
			НЗ.Записать();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
//
&НаСервере
Процедура ПроверитьФМНаСервере(Ссылка=Неопределено,ЭтоФМ = Ложь,ВсюИерархию = Ложь)
	Если ЭтоФМ Тогда 
		Результат = гкс_ПроверкаФункциональныхМест.ПроверитьОграниченияМассиваОР(,Ссылка);
	ИначеЕсли ВсюИерархию Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	торо_ИерархическиеСтруктурыОР.РодительИерархии КАК Ссылка
			|ПОМЕСТИТЬ ВсеФМ
			|ИЗ
			|	РегистрСведений.торо_ИерархическиеСтруктурыОР КАК торо_ИерархическиеСтруктурыОР
			|ГДЕ
			|	торо_ИерархическиеСтруктурыОР.СтруктураИерархии = &СтруктураИерархии
			|	И торо_ИерархическиеСтруктурыОР.РодительИерархии.ТипОбъекта = &ТипОбъекта
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	торо_РасположениеОРВСтруктуреИерархииСрезПоследних.РодительИерархии
			|ИЗ
			|	РегистрСведений.торо_РасположениеОРВСтруктуреИерархии.СрезПоследних(, СтруктураИерархии = &СтруктураИерархии) КАК торо_РасположениеОРВСтруктуреИерархииСрезПоследних
			|ГДЕ
			|	торо_РасположениеОРВСтруктуреИерархииСрезПоследних.РодительИерархии.ТипОбъекта = &ТипОбъекта
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	торо_ИерархическиеСтруктурыОР.ОбъектИерархии
			|ИЗ
			|	РегистрСведений.торо_ИерархическиеСтруктурыОР КАК торо_ИерархическиеСтруктурыОР
			|ГДЕ
			|	торо_ИерархическиеСтруктурыОР.СтруктураИерархии = &СтруктураИерархии
			|	И торо_ИерархическиеСтруктурыОР.ОбъектИерархии.ТипОбъекта = &ТипОбъекта
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	торо_РасположениеОРВСтруктуреИерархииСрезПоследних.ОбъектИерархии
			|ИЗ
			|	РегистрСведений.торо_РасположениеОРВСтруктуреИерархии.СрезПоследних(, СтруктураИерархии = &СтруктураИерархии) КАК торо_РасположениеОРВСтруктуреИерархииСрезПоследних
			|ГДЕ
			|	торо_РасположениеОРВСтруктуреИерархииСрезПоследних.ОбъектИерархии.ТипОбъекта = &ТипОбъекта
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ВсеФМ.Ссылка КАК Ссылка
			|ИЗ
			|	ВсеФМ КАК ВсеФМ";
		
		Запрос.УстановитьПараметр("СтруктураИерархии", ТекСтруктураИерархии);
		Запрос.УстановитьПараметр("ТипОбъекта", ТипОбъектаФМ);
		
		ТемпМассив = Новый Массив();
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() = Ложь Тогда 
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				ТемпМассив.Добавить(Выборка.Ссылка);
			КонецЦикла;
			Результат = гкс_ПроверкаФункциональныхМест.ПроверитьОграниченияМассиваОР(,ТемпМассив);
		Иначе
			Возврат;
		КонецЕсли;
	Иначе

		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	торо_ИерархическиеСтруктурыОР.РодительИерархии КАК Ссылка
			|ИЗ
			|	РегистрСведений.торо_ИерархическиеСтруктурыОР КАК торо_ИерархическиеСтруктурыОР
			|ГДЕ
			|	торо_ИерархическиеСтруктурыОР.СтруктураИерархии = &СтруктураИерархии
			|	И торо_ИерархическиеСтруктурыОР.ОбъектИерархии = &Ссылка
			|	И торо_ИерархическиеСтруктурыОР.РодительИерархии.ТипОбъекта = &ТипОбъекта
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	торо_РасположениеОРВСтруктуреИерархииСрезПоследних.РодительИерархии
			|ИЗ
			|	РегистрСведений.торо_РасположениеОРВСтруктуреИерархии.СрезПоследних(
			|			,
			|			СтруктураИерархии = &СтруктураИерархии
			|				И ОбъектИерархии = &Ссылка) КАК торо_РасположениеОРВСтруктуреИерархииСрезПоследних
			|ГДЕ
			|	торо_РасположениеОРВСтруктуреИерархииСрезПоследних.РодительИерархии.ТипОбъекта = &ТипОбъекта";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("СтруктураИерархии", ТекСтруктураИерархии);
		Запрос.УстановитьПараметр("ТипОбъекта", ТипОбъектаФМ);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() = Ложь Тогда 
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			Результат = гкс_ПроверкаФункциональныхМест.ПроверитьОграниченияМассиваОР(,Выборка.Ссылка);
		Иначе
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	Если ТипЗнч(Результат) = Тип("Структура") Тогда 
		Если Результат.Свойство("НеПодходят") Тогда 
			Для Каждого СМ Из Результат.НеПодходят Цикл
				НеНайден = Истина;
				Для Каждого СТ ИЗ ПроверенныеОР Цикл
					Если СТ.ОР = СМ.Ссылка Тогда 
						СТ.Подходит = Ложь;
						НеНайден = Ложь;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				Если НеНайден Тогда 
					НС = ПроверенныеОР.Добавить();
					НС.ОР = СМ.Ссылка;
					НС.Подходит = Ложь;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		Если Результат.Свойство("Подходят")  Тогда 
			Найденные = Новый Массив();
			Для Каждого СТ ИЗ ПроверенныеОР Цикл
				Если Не Результат.Подходят.Найти(СТ.ОР) = Неопределено Тогда 
					СТ.Подходит = Истина;
					Найденные.Добавить(СТ.ОР);
					Если Найденные.Количество() = Результат.Подходят.Количество() Тогда 
						Прервать;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			Если не Найденные.Количество() = Результат.Подходят.Количество() Тогда 
				Для Каждого СМ Из Результат.Подходят Цикл
					Если Найденные.Найти(СМ) = Неопределено Тогда 
						НС = ПроверенныеОР.Добавить();
						НС.ОР = СМ;
						НС.Подходит = Истина;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	ДозаполнитьДерево();
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьФМ(Команда)
	ТекущиеДанные = Элементы.Дерево.ТекущиеДанные;
	Если Не ТекущиеДанные = Неопределено Тогда 
		Если ТекущиеДанные.ТипОбъекта = ТипОбъектаФМ Тогда 
			ПроверитьФМНаСервере(ТекущиеДанные.Ссылка,Истина);
		Иначе
			ПроверитьФМНаСервере(ТекущиеДанные.Ссылка,Ложь);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВсе(Команда)
	ПроверитьФМНаСервере(,Ложь,Истина);
КонецПроцедуры
// отметить проверенные строки в дереве
&НаСервере
Процедура ДозаполнитьДерево()
	Если ПроверенныеОР.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	МассивПодходит = Новый Массив();
	МассивНеПодходит = Новый Массив();
	Для Каждого СТ Из ПроверенныеОР Цикл 
		Если СТ.Подходит Тогда 
			МассивПодходит.Добавить(СТ.ОР);
		Иначе
			МассивНеПодходит.Добавить(СТ.ОР);
		КонецЕсли;
	КонецЦикла;
	ДозаполнитьДеревоГлубже(Дерево,МассивПодходит,МассивНеПодходит);
КонецПроцедуры

&НаСервере
Процедура ДозаполнитьДеревоГлубже(ТекУровень,МассивДа,МассивНет)
	Корень = ТекУровень.ПолучитьЭлементы();
	Для Каждого СТ Из Корень Цикл
		СТ.Подходит = Ложь;
		СТ.НеПодходит = Ложь;
		Если Не МассивДа.Найти(СТ.Ссылка) = Неопределено Тогда 
			СТ.Подходит = Истина;
		ИначеЕсли Не МассивНет.Найти(СТ.Ссылка) = Неопределено Тогда 
			СТ.НеПодходит = Истина;
		КонецЕсли;
		ДозаполнитьДеревоГлубже(СТ,МассивДа,МассивНет);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДозаполнитьДеревоНаКлиенте()
	Если ПроверенныеОР.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	МассивПодходит = Новый Массив();
	МассивНеПодходит = Новый Массив();
	Для Каждого СТ Из ПроверенныеОР Цикл 
		Если СТ.Подходит Тогда 
			МассивПодходит.Добавить(СТ.ОР);
		Иначе
			МассивНеПодходит.Добавить(СТ.ОР);
		КонецЕсли;
	КонецЦикла;
	ДозаполнитьДеревоГлубжеНаКлиенте(Дерево,МассивПодходит,МассивНеПодходит);
КонецПроцедуры

&НаКлиенте
Процедура ДозаполнитьДеревоГлубжеНаКлиенте(ТекУровень,МассивДа,МассивНет)
	Корень = ТекУровень.ПолучитьЭлементы();
	Для Каждого СТ Из Корень Цикл
		СТ.Подходит = Ложь;
		СТ.НеПодходит = Ложь;
		Если Не МассивДа.Найти(СТ.Ссылка) = Неопределено Тогда 
			СТ.Подходит = Истина;
		ИначеЕсли Не МассивНет.Найти(СТ.Ссылка) = Неопределено Тогда 
			СТ.НеПодходит = Истина;
		КонецЕсли;
		ДозаполнитьДеревоГлубжеНаКлиенте(СТ,МассивДа,МассивНет);
	КонецЦикла;
	
КонецПроцедуры
//
&НаКлиенте
Процедура ПроверенныеОРВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекДанные = Элементы.ПроверенныеОР.ТекущиеДанные;
	Если не ТекДанные = Неопределено Тогда 
		ИдСтроки = Неопределено;
		НайтиСтрокуДереваГлубже(Дерево,ТекДанные.ОР,ИдСтроки);
		Если ЗначениеЗаполнено(ИдСтроки) Тогда 
			Элементы.Дерево.ТекущаяСтрока = ИдСтроки;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НайтиСтрокуДереваГлубже(ТекУровень,Ссылка,ИдСтроки = Неопределено)
	Корень = ТекУровень.ПолучитьЭлементы();
	Для Каждого СТ Из Корень Цикл
		Если ЗначениеЗаполнено(ИдСтроки) Тогда 
			Возврат;
		КонецЕсли;
		Если СТ.Ссылка = Ссылка Тогда 
			ИдСтроки = СТ.ПолучитьИдентификатор();
			Возврат;
		КонецЕсли;
		НайтиСтрокуДереваГлубже(СТ,Ссылка,ИдСтроки);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ИзмененаСтруктураИерархииОР" Тогда
		торо_РаботаСИерархией20Клиент.ОбновитьДеревоИерархии(ЭтотОбъект, "Дерево");
		ТекДанные = Элементы.Дерево.ТекущиеДанные;
		Если НЕ ТекДанные = Неопределено Тогда 
			Для Каждого СТ Из ПроверенныеОР Цикл
				Если СТ.ОР = ТекДанные.Ссылка Тогда 
					ПроверенныеОР.Удалить(СТ);
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		ДозаполнитьДеревоНаКлиенте();
	ИначеЕсли ИмяСобытия = "ЗаписанОбъектРемонта" Тогда
		торо_РаботаСИерархией20Клиент.ОбновитьДеревоИерархии(ЭтотОбъект, "Дерево");
		//ДозаполнитьДеревоНаКлиенте();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьФМ(Команда)
	
КонецПроцедуры
